{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_6", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3243714, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding_6", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_6", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "spatial_dropout1d_6", "inbound_nodes": [[["embedding_6", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_29", "trainable": true, "dtype": "float32", "filters": 200, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 6}, "bias_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 7}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_29", "inbound_nodes": [[["spatial_dropout1d_6", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_30", "trainable": true, "dtype": "float32", "filters": 200, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 6}, "bias_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 7}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_30", "inbound_nodes": [[["spatial_dropout1d_6", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_31", "trainable": true, "dtype": "float32", "filters": 200, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 6}, "bias_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 7}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_31", "inbound_nodes": [[["spatial_dropout1d_6", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_32", "trainable": true, "dtype": "float32", "filters": 200, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 6}, "bias_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 7}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_32", "inbound_nodes": [[["spatial_dropout1d_6", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_29", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_29", "inbound_nodes": [[["conv1d_29", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_30", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_30", "inbound_nodes": [[["conv1d_30", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_31", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_31", "inbound_nodes": [[["conv1d_31", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_32", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_32", "inbound_nodes": [[["conv1d_32", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_6", "inbound_nodes": [[["global_max_pooling1d_29", 0, 0, {}], ["global_max_pooling1d_30", 0, 0, {}], ["global_max_pooling1d_31", 0, 0, {}], ["global_max_pooling1d_32", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_6", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["dense_12", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0]], "output_layers": [["dense_13", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of100.bin", "group1-shard2of100.bin", "group1-shard3of100.bin", "group1-shard4of100.bin", "group1-shard5of100.bin", "group1-shard6of100.bin", "group1-shard7of100.bin", "group1-shard8of100.bin", "group1-shard9of100.bin", "group1-shard10of100.bin", "group1-shard11of100.bin", "group1-shard12of100.bin", "group1-shard13of100.bin", "group1-shard14of100.bin", "group1-shard15of100.bin", "group1-shard16of100.bin", "group1-shard17of100.bin", "group1-shard18of100.bin", "group1-shard19of100.bin", "group1-shard20of100.bin", "group1-shard21of100.bin", "group1-shard22of100.bin", "group1-shard23of100.bin", "group1-shard24of100.bin", "group1-shard25of100.bin", "group1-shard26of100.bin", "group1-shard27of100.bin", "group1-shard28of100.bin", "group1-shard29of100.bin", "group1-shard30of100.bin", "group1-shard31of100.bin", "group1-shard32of100.bin", "group1-shard33of100.bin", "group1-shard34of100.bin", "group1-shard35of100.bin", "group1-shard36of100.bin", "group1-shard37of100.bin", "group1-shard38of100.bin", "group1-shard39of100.bin", "group1-shard40of100.bin", "group1-shard41of100.bin", "group1-shard42of100.bin", "group1-shard43of100.bin", "group1-shard44of100.bin", "group1-shard45of100.bin", "group1-shard46of100.bin", "group1-shard47of100.bin", "group1-shard48of100.bin", "group1-shard49of100.bin", "group1-shard50of100.bin", "group1-shard51of100.bin", "group1-shard52of100.bin", "group1-shard53of100.bin", "group1-shard54of100.bin", "group1-shard55of100.bin", "group1-shard56of100.bin", "group1-shard57of100.bin", "group1-shard58of100.bin", "group1-shard59of100.bin", "group1-shard60of100.bin", "group1-shard61of100.bin", "group1-shard62of100.bin", "group1-shard63of100.bin", "group1-shard64of100.bin", "group1-shard65of100.bin", "group1-shard66of100.bin", "group1-shard67of100.bin", "group1-shard68of100.bin", "group1-shard69of100.bin", "group1-shard70of100.bin", "group1-shard71of100.bin", "group1-shard72of100.bin", "group1-shard73of100.bin", "group1-shard74of100.bin", "group1-shard75of100.bin", "group1-shard76of100.bin", "group1-shard77of100.bin", "group1-shard78of100.bin", "group1-shard79of100.bin", "group1-shard80of100.bin", "group1-shard81of100.bin", "group1-shard82of100.bin", "group1-shard83of100.bin", "group1-shard84of100.bin", "group1-shard85of100.bin", "group1-shard86of100.bin", "group1-shard87of100.bin", "group1-shard88of100.bin", "group1-shard89of100.bin", "group1-shard90of100.bin", "group1-shard91of100.bin", "group1-shard92of100.bin", "group1-shard93of100.bin", "group1-shard94of100.bin", "group1-shard95of100.bin", "group1-shard96of100.bin", "group1-shard97of100.bin", "group1-shard98of100.bin", "group1-shard99of100.bin", "group1-shard100of100.bin"], "weights": [{"name": "conv1d_29/kernel", "shape": [2, 32, 200], "dtype": "float32"}, {"name": "conv1d_29/bias", "shape": [200], "dtype": "float32"}, {"name": "conv1d_30/kernel", "shape": [3, 32, 200], "dtype": "float32"}, {"name": "conv1d_30/bias", "shape": [200], "dtype": "float32"}, {"name": "conv1d_31/kernel", "shape": [4, 32, 200], "dtype": "float32"}, {"name": "conv1d_31/bias", "shape": [200], "dtype": "float32"}, {"name": "conv1d_32/kernel", "shape": [5, 32, 200], "dtype": "float32"}, {"name": "conv1d_32/bias", "shape": [200], "dtype": "float32"}, {"name": "dense_12/kernel", "shape": [800, 50], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_13/kernel", "shape": [50, 1], "dtype": "float32"}, {"name": "dense_13/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_6/embeddings", "shape": [3243714, 32], "dtype": "float32"}]}]}