{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3699997, "output_dim": 16, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "spatial_dropout1d", "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 6}, "bias_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 7}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d", "inbound_nodes": [[["spatial_dropout1d", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 6}, "bias_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 7}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_1", "inbound_nodes": [[["spatial_dropout1d", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 6}, "bias_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 7}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_2", "inbound_nodes": [[["spatial_dropout1d", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [6], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 6}, "bias_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 7}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_3", "inbound_nodes": [[["spatial_dropout1d", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [8], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 6}, "bias_regularizer": {"class_name": "L1L2", "config": {"L1L2": 9.999999747378752e-06}, "shared_object_id": 7}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_4", "inbound_nodes": [[["spatial_dropout1d", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d", "inbound_nodes": [[["conv1d", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_2", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_3", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_3", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_4", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_4", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["global_max_pooling1d", 0, 0, {}], ["global_max_pooling1d_1", 0, 0, {}], ["global_max_pooling1d_2", 0, 0, {}], ["global_max_pooling1d_3", 0, 0, {}], ["global_max_pooling1d_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of57.bin", "group1-shard2of57.bin", "group1-shard3of57.bin", "group1-shard4of57.bin", "group1-shard5of57.bin", "group1-shard6of57.bin", "group1-shard7of57.bin", "group1-shard8of57.bin", "group1-shard9of57.bin", "group1-shard10of57.bin", "group1-shard11of57.bin", "group1-shard12of57.bin", "group1-shard13of57.bin", "group1-shard14of57.bin", "group1-shard15of57.bin", "group1-shard16of57.bin", "group1-shard17of57.bin", "group1-shard18of57.bin", "group1-shard19of57.bin", "group1-shard20of57.bin", "group1-shard21of57.bin", "group1-shard22of57.bin", "group1-shard23of57.bin", "group1-shard24of57.bin", "group1-shard25of57.bin", "group1-shard26of57.bin", "group1-shard27of57.bin", "group1-shard28of57.bin", "group1-shard29of57.bin", "group1-shard30of57.bin", "group1-shard31of57.bin", "group1-shard32of57.bin", "group1-shard33of57.bin", "group1-shard34of57.bin", "group1-shard35of57.bin", "group1-shard36of57.bin", "group1-shard37of57.bin", "group1-shard38of57.bin", "group1-shard39of57.bin", "group1-shard40of57.bin", "group1-shard41of57.bin", "group1-shard42of57.bin", "group1-shard43of57.bin", "group1-shard44of57.bin", "group1-shard45of57.bin", "group1-shard46of57.bin", "group1-shard47of57.bin", "group1-shard48of57.bin", "group1-shard49of57.bin", "group1-shard50of57.bin", "group1-shard51of57.bin", "group1-shard52of57.bin", "group1-shard53of57.bin", "group1-shard54of57.bin", "group1-shard55of57.bin", "group1-shard56of57.bin", "group1-shard57of57.bin"], "weights": [{"name": "conv1d/kernel", "shape": [3, 16, 100], "dtype": "float32"}, {"name": "conv1d/bias", "shape": [100], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [4, 16, 100], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [100], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [5, 16, 100], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [100], "dtype": "float32"}, {"name": "conv1d_3/kernel", "shape": [6, 16, 100], "dtype": "float32"}, {"name": "conv1d_3/bias", "shape": [100], "dtype": "float32"}, {"name": "conv1d_4/kernel", "shape": [8, 16, 100], "dtype": "float32"}, {"name": "conv1d_4/bias", "shape": [100], "dtype": "float32"}, {"name": "dense/kernel", "shape": [500, 50], "dtype": "float32"}, {"name": "dense/bias", "shape": [50], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [50, 1], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding/embeddings", "shape": [3699997, 16], "dtype": "float32"}]}]}